micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2018-2019 Damien P. George
 * Copyright (c) 2023 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>
#include "py/runtime.h"
#include "py/objstr.h"
#include "py/mphal.h"

#if MICROPY_PY_NETWORK_IFX_WCM

#include "lwip/netif.h"
#include "lwip/dns.h"
#include "whd.h"
#include "whd_network_types.h"
#include "whd_wlioctl.h"
#include "network_ifx_wcm.h"
#include "whd_wifi_api.h"
#include "extmod/modnetwork.h"
#include "cy_wcm.h"
#include "cy_nw_helper.h"
#include "mplogger.h"

#include "FreeRTOS.h"
#include "shared/netutils/netutils.h"

extern uint8_t cy_wcm_is_ap_up();

// Function prototypes
static void network_ifx_wcm_scan_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status);
static void print_scan_result(cy_wcm_scan_result_t *result);

cy_wcm_ip_address_t ip_address;
cy_wcm_ip_address_t net_mask_addr;
cy_wcm_ip_address_t gateway_addr;
cy_wcm_ip_setting_t ap_ip;

cy_wcm_scan_filter_t scan_filter;
uint32_t num_scan_result;
enum scan_filter_mode scan_filter_mode_select = SCAN_FILTER_SSID;
void *ntwk_scan_result;
mp_obj_t scan_list;

// static cy_wcm_ap_credentials_t ap_credentials = {
//     SSID,
//     password,
//     security
// }

// static cy_wcm_ap_config_t ap_config = {
//     ap_credentials,
//     WLAN_AP_DEFAULT_CHANNEL,
//     ap_ip_settings,
//     ie_info
// };

#define NETWORK_WLAN_AP_CHANNEL_AP 4
#define NETWORK_WLAN_AP_IP "192.168.0.1"
#define NETWORK_WLAN_AP_GATEWAY_IP "192.168.0.1"
#define NETWORK_WLAN_AP_NETMASK_IP  "255.255.255.0"


typedef struct
{
    cy_wcm_ap_config_t ap_config;
} network_ifx_wcm_ap_obj_t;

typedef struct
{
    uint32_t var;
} network_ifx_wcm_sta_obj_t;

typedef union {
    network_ifx_wcm_ap_obj_t ap_obj;
    network_ifx_wcm_sta_obj_t sta_obj;
} itf_obj_t;

typedef struct _network_ifx_wcm_obj_t {
    mp_obj_base_t base;
    cy_wcm_interface_t itf;
    itf_obj_t itf_obj;
    cy_wcm_ip_setting_t ip_config;
} network_ifx_wcm_obj_t;

#define MAX_WHD_INTERFACE  (2)

extern whd_interface_t whd_ifs[MAX_WHD_INTERFACE];

STATIC network_ifx_wcm_obj_t network_ifx_wcm_wl_sta = { { &mp_network_ifx_wcm_type }, CY_WCM_INTERFACE_TYPE_STA };
STATIC network_ifx_wcm_obj_t network_ifx_wcm_wl_ap = { { &mp_network_ifx_wcm_type }, CY_WCM_INTERFACE_TYPE_AP };

#define wcm_assert_raise(ret)   if (ret != CY_RSLT_SUCCESS) { \
}
// mp_raise_OSError(-ret);

// Error handling method
void error_handler(cy_rslt_t result, char *message) {
    if (NULL != message) {
        ERR_INFO(("%lu", result));
        ERR_INFO(("%s", message));
    }
    __disable_irq();
    CY_ASSERT(0);
}

// Based on the scan result, get micropython defined equivalent security type (possible value 0-4, extended till 7 to include all cases) and security string (mapped to IFX stack)
static char *get_security_string_and_type(cy_wcm_scan_result_t *result, uint8_t *security_type) {
    /* Convert the security type of the scan result to the corresponding
     * security string
     */
    char *security_type_string;
    switch (result->security)
    {
        case CY_WCM_SECURITY_OPEN:
            security_type_string = SECURITY_OPEN;
            *security_type = 0;
            break;
        case CY_WCM_SECURITY_WEP_PSK:
            security_type_string = SECURITY_WEP_PSK;
            *security_type = 1;
            break;
        case CY_WCM_SECURITY_WEP_SHARED:
            security_type_string = SECURITY_WEP_SHARED;
            *security_type = 1;
            break;
        case CY_WCM_SECURITY_WPA_TKIP_PSK:
            security_type_string = SECURITY_WEP_TKIP_PSK;
            *security_type = 1;
            break;
        case CY_WCM_SECURITY_WPA_AES_PSK:
            security_type_string = SECURITY_WPA_AES_PSK;
            *security_type = 4;
            break;
        case CY_WCM_SECURITY_WPA_MIXED_PSK:
            security_type_string = SECURITY_WPA_MIXED_PSK;
            *security_type = 4;
            break;
        case CY_WCM_SECURITY_WPA2_AES_PSK:
            security_type_string = SECURITY_WPA2_AES_PSK;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_TKIP_PSK:
            security_type_string = SECURITY_WPA2_TKIP_PSK;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_MIXED_PSK:
            security_type_string = SECURITY_WPA2_MIXED_PSK;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_FBT_PSK:
            security_type_string = SECURITY_WPA2_FBT_PSK;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA3_SAE:
            security_type_string = SECURITY_WPA3_SAE;
            *security_type = 5; // Not supported value in mpy. New define!
            break;
        case CY_WCM_SECURITY_WPA3_WPA2_PSK:
            security_type_string = SECURITY_WPA3_WPA2_PSK;
            *security_type = 5; // Not supported value in mpy. New define!
            break;
        case CY_WCM_SECURITY_IBSS_OPEN:
            security_type_string = SECURITY_IBSS_OPEN;
            *security_type = 0;
            break;
        case CY_WCM_SECURITY_WPS_SECURE:
            security_type_string = SECURITY_WPS_SECURE;
            *security_type = 6; // Not supported value in mpy. New define!
            break;
        case CY_WCM_SECURITY_UNKNOWN:
            security_type_string = SECURITY_UNKNOWN;
            *security_type = 7; // Not supported value in mpy. New define!
            break;
        case CY_WCM_SECURITY_WPA2_WPA_AES_PSK:
            security_type_string = SECURITY_WPA2_WPA_AES_PSK;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK:
            security_type_string = SECURITY_WPA2_WPA_MIXED_PSK;
            *security_type = 4;
            break;
        case CY_WCM_SECURITY_WPA_TKIP_ENT:
            security_type_string = SECURITY_WPA_TKIP_ENT;
            *security_type = 2;
            break;
        case CY_WCM_SECURITY_WPA_AES_ENT:
            security_type_string = SECURITY_WPA_AES_ENT;
            *security_type = 2;
            break;
        case CY_WCM_SECURITY_WPA_MIXED_ENT:
            security_type_string = SECURITY_WPA_MIXED_ENT;
            *security_type = 2;
            break;
        case CY_WCM_SECURITY_WPA2_TKIP_ENT:
            security_type_string = SECURITY_WPA2_TKIP_ENT;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_AES_ENT:
            security_type_string = SECURITY_WPA2_AES_ENT;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_MIXED_ENT:
            security_type_string = SECURITY_WPA2_MIXED_ENT;
            *security_type = 3;
            break;
        case CY_WCM_SECURITY_WPA2_FBT_ENT:
            security_type_string = SECURITY_WPA2_FBT_ENT;
            *security_type = 3;
            break;
        default:
            security_type_string = SECURITY_UNKNOWN;
            *security_type = 7; // Not supported value in mpy. New define!
            break;
    }
    return security_type_string;
}

// Helper function to print scan results
static void print_scan_result(cy_wcm_scan_result_t *result) {
    uint8_t security_type = 0;

    char *security_type_string = get_security_string_and_type(result, &security_type);

    printf(" %2" PRIu32 "   %-32s     %4d     %2d      %02X:%02X:%02X:%02X:%02X:%02X         %-15s\n",
        num_scan_result, result->SSID,
        result->signal_strength, result->channel, result->BSSID[0], result->BSSID[1],
        result->BSSID[2], result->BSSID[3], result->BSSID[4], result->BSSID[5],
        security_type_string);
}

// Callback function for scan method. After each scan result, the scan callback is executed.
static void network_ifx_wcm_scan_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status) {
    scan_list = MP_OBJ_FROM_PTR(ntwk_scan_result);
    char bssid_buf[24];
    uint8_t hidden_status = 1; // HIDDEN
    uint8_t security_type = 0; // OPEN

    if (status == CY_WCM_SCAN_INCOMPLETE) {
        num_scan_result++;

