micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
        // Populate BSSID buffer
        snprintf(bssid_buf, sizeof(bssid_buf), "%u.%u.%u.%u.%u.%u", result_ptr->BSSID[0], result_ptr->BSSID[1], result_ptr->BSSID[2], result_ptr->BSSID[3], result_ptr->BSSID[4], result_ptr->BSSID[5]);

        // Get the network status : hidden(1) or open(0)
        if (strlen((const char *)result_ptr->SSID) != 0) {
            hidden_status = 0;
        }

        // Get security type as mapped in micropython function description
        get_security_string_and_type(result_ptr, &security_type);

        mp_obj_t tuple[6] = {
            mp_obj_new_bytes(result_ptr->SSID, strlen((const char *)result_ptr->SSID)),
            mp_obj_new_bytes((const byte *)bssid_buf, strlen((const char *)bssid_buf)),
            MP_OBJ_NEW_SMALL_INT(result_ptr->channel),
            MP_OBJ_NEW_SMALL_INT(result_ptr->signal_strength),
            MP_OBJ_NEW_SMALL_INT(security_type),
            MP_OBJ_NEW_SMALL_INT(hidden_status)
        };
        mp_obj_list_append(scan_list, mp_obj_new_tuple(6, tuple));
        print_scan_result(result_ptr);

    }

    if ((CY_WCM_SCAN_COMPLETE == status)) {
        /* Reset the number of scan results to 0 for the next scan.*/
        num_scan_result = 0;
    }
    return;
}

void network_ap_init(void) {
    /* Default AP credential configuration */
    // memcpy(network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config.ap_credentials.SSID, NETWORK_WLAN_DEFAULT_SSID, strlen(NETWORK_WLAN_DEFAULT_SSID) + 1);
    // memcpy(network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config.ap_credentials.password, NETWORK_WLAN_DEFAULT_PASSWORD, strlen(NETWORK_WLAN_DEFAULT_PASSWORD) + 1);
    // network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config.ap_credentials.security = CY_WCM_SECURITY_OPEN;

    // /* AP channel configuration */
    // network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config.channel = NETWORK_WLAN_AP_CHANNEL_AP;

    // // char *ip = "192.168.0.2";
    // // char *netmask = "255.255.255.0";
    // // char *gateway = "192.168.0.2";

    // cy_rslt_t result = cy_wcm_set_ap_ip_setting(&(network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config.ip_settings) , NETWORK_WLAN_AP_IP, NETWORK_WLAN_AP_NETMASK_IP, NETWORK_WLAN_AP_GATEWAY_IP, CY_WCM_IP_VER_V4);
    // if (result != CY_RSLT_SUCCESS) {
    //     // error_handler(result, "Failed to initialize Wi-Fi Connection Manager.\n");
    //         mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("ap_ip_setting failed with error %lx !"), result);
    // }
    // mplogger_print("ap_ip_setting worked !");
}

// Network Initialization function (called from main.c)
void network_init(void) {
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_wcm_config_t wcm_config = { .interface = CY_WCM_INTERFACE_TYPE_AP_STA };

    // memset(&scan_filter, 0, sizeof(cy_wcm_scan_filter_t));
    result = cy_wcm_init(&wcm_config);
    if (result != CY_RSLT_SUCCESS) {
        // error_handler(result, "Failed to initialize Wi-Fi Connection Manager.\n");
        mp_raise_ValueError(MP_ERROR_TEXT("wifi connection manager init error"));
    }
    // printf("are we event entering here?");

    // network_ap_init();
}

void network_deinit(void) {
    cy_rslt_t result = cy_wcm_deinit();
    if (result != CY_RSLT_SUCCESS) {
        // error_handler(result, "Failed to initialize Wi-Fi Connection Manager.\n");
        // mp_raise_ValueError(MP_ERROR_TEXT("wifi connection manager deinit error"));
    }
}

// static void ap_event_callback(cy_wcm_event_t event, cy_wcm_event_data_t *event_data)
// {
//     char ip4_str[16];
//     cy_nw_ip_address_t nw_ipv4;

//     printf("######### Received event changed from wcm, event = %d #######\n", event);
//     switch(event)
//     {
//         case CY_WCM_EVENT_DISCONNECTED:
//         {
//             mp_raise_ValueError(MP_ERROR_TEXT("Network is down! \n"));
//             break;
//         }
//         case CY_WCM_EVENT_RECONNECTED:
//         {
//             mp_raise_ValueError(MP_ERROR_TEXT("Network is up again! \n"));
//             break;
//         }
//         case CY_WCM_EVENT_CONNECTING:
//         {
//             mp_raise_ValueError(MP_ERROR_TEXT("Connecting to AP ... \n"));
//             break;
//         }
//         case CY_WCM_EVENT_CONNECTED:
//         {
//             mp_raise_ValueError(MP_ERROR_TEXT("Connected to AP and network is up !! \n"));
//             break;
//         }
//         case CY_WCM_EVENT_CONNECT_FAILED:
//         {
//             mp_raise_ValueError(MP_ERROR_TEXT("Connection to AP Failed ! \n"));
//             break;
//         }
//         case CY_WCM_EVENT_IP_CHANGED:
//         {
//             cy_wcm_ip_address_t ip_addr;
//             cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_STA, &ip_addr);

//             if(event_data->ip_addr.version == CY_WCM_IP_VER_V4)
//             {
//                 nw_ipv4.ip.v4 = event_data->ip_addr.ip.v4;
//                 cy_nw_ntoa(&nw_ipv4, ip4_str);
//                 // mp_raise_ValueError(MP_ERROR_TEXT("IPV4 address: %s\n", ip4_str));
//             }
//             break;
//         }
//         case CY_WCM_EVENT_STA_JOINED_SOFTAP:
//         {
//             // mp_raise_ValueError(MP_ERROR_TEXT("mac address of the STA which joined = %02X : %02X : %02X : %02X : %02X : %02X \n",
//             //         event_data->sta_mac[0], event_data->sta_mac[1], event_data->sta_mac[2],
//             //         event_data->sta_mac[3], event_data->sta_mac[4], event_data->sta_mac[5]);
//             break;
//         }
//         case CY_WCM_EVENT_STA_LEFT_SOFTAP:
//         {
//             // mp_raise_ValueError(MP_ERROR_TEXT("mac address of the STA which left = %02X : %02X : %02X : %02X : %02X : %02X \n",
//             //         event_data->sta_mac[0], event_data->sta_mac[1], event_data->sta_mac[2],
//             //         event_data->sta_mac[3], event_data->sta_mac[4], event_data->sta_mac[5]))
//             break;
//         }
//         default:
//         {
//             // mp_raise_ValueError(MP_ERROR_TEXT("Invalid event \n"));
//             break;
//         }
//     }
// }

#define MAX_WIFI_RETRY_COUNT                (3u)
#define WIFI_CONN_RETRY_INTERVAL_MSEC       (100u)

/* The size of the cy_wcm_ip_address_t array that is passed to
 * cy_wcm_get_ip_addr API. In the case of stand-alone AP or STA mode, the size of
 * the array is 1. In concurrent AP/STA mode, the size of the array is 2 where
 * the first index stores the IP address of the STA and the second index
 * stores the IP address of the AP.
 */

static cy_wcm_ip_setting_t ap_sta_mode_ip_settings;

void snippet_wcm_concurrent_mode() {
    cy_rslt_t result;
    // char ip6_str[40];
    // char ip4_str[16];
    char *ip = "192.168.0.2";
    char *netmask = "255.255.255.0";
    char *gateway = "192.168.0.2";
    // cy_nw_ip_address_t nw_ipv4;
    // cy_nw_ip_address_t nw_ipv6;

    /* Initialize the Wi-Fi device as a STA.*/
    // cy_wcm_config_t config = {.interface = CY_WCM_INTERFACE_TYPE_AP_STA};
    cy_wcm_ap_config_t ap_conf;
    cy_wcm_connect_params_t connect_param;
    cy_wcm_ip_address_t ip_address, ipv4_addr, ipv6_addr;
    cy_wcm_security_t security;

    memset(&connect_param, 0, sizeof(cy_wcm_connect_params_t));
    memset(&ip_address, 0, sizeof(cy_wcm_ip_address_t));
    memset(&security, 0, sizeof(cy_wcm_security_t));
    memcpy(connect_param.ap_credentials.SSID, NETWORK_WLAN_DEFAULT_SSID, sizeof(NETWORK_WLAN_DEFAULT_SSID));
    memcpy(connect_param.ap_credentials.password, NETWORK_WLAN_DEFAULT_PASSWORD, sizeof(NETWORK_WLAN_DEFAULT_PASSWORD));
    connect_param.ap_credentials.security = security;

