micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
    /* Initialize the Wi-Fi device, Wi-Fi transport, and lwIP network stack.*/
    // result = cy_wcm_init(&config);
    // if(result != CY_RSLT_SUCCESS)
    // {
    //     printf("\ncy_wcm_init failed...!\n");
    //     // return;
    // }

    /* AP settings */
    cy_wcm_set_ap_ip_setting(&ap_sta_mode_ip_settings, ip, netmask, gateway, CY_WCM_IP_VER_V4);

    // printf("\n*** Starting STA Mode ***\n");
    // /* Attempt to connect to Wi-Fi until a connection is made or
    //  * MAX_WIFI_RETRY_COUNT attempts have been made.
    //  */
    // for (uint32_t conn_retries = 0; conn_retries < MAX_WIFI_RETRY_COUNT; conn_retries++)
    // {
    //     result = cy_wcm_connect_ap(&connect_param, &ip_address);
    //     if (result != CY_RSLT_SUCCESS)
    //     {
    //         printf("Successfully connected to Wi-Fi network '%s'.\n", connect_param.ap_credentials.SSID);

    //         /* Register event callbacks for changes in the Wi-Fi link status. These
    //          * events could be related to IP address changes, connection, and
    //          * disconnection events.
    //          */
    //         // cy_wcm_register_event_callback(sta_event_callback);
    //         break;
    //     }

    //     printf("Connection to Wi-Fi network failed with error code %d."
    //             "Retrying in %d ms...\n", (int)result, WIFI_CONN_RETRY_INTERVAL_MSEC);

    //     // cy_rtos_delay_milliseconds(WIFI_CONN_RETRY_INTERVAL_MSEC);
    // }

    // printf("\n*** Starting AP Mode ***\n");
    memset(&ap_conf, 0, sizeof(cy_wcm_ap_config_t));
    memset(&ipv4_addr, 0, sizeof(cy_wcm_ip_address_t));
    memset(&ipv6_addr, 0, sizeof(cy_wcm_ip_address_t));

    ap_conf.channel = 9;
    memcpy(ap_conf.ap_credentials.SSID, NETWORK_WLAN_DEFAULT_SSID, strlen(NETWORK_WLAN_DEFAULT_SSID) + 1);
    memcpy(ap_conf.ap_credentials.password, NETWORK_WLAN_DEFAULT_PASSWORD, strlen(NETWORK_WLAN_DEFAULT_PASSWORD) + 1);
    ap_conf.ap_credentials.security = CY_WCM_SECURITY_WPA2_AES_PSK;

    ap_conf.ip_settings.ip_address = ap_sta_mode_ip_settings.ip_address;
    ap_conf.ip_settings.netmask = ap_sta_mode_ip_settings.netmask;
    ap_conf.ip_settings.gateway = ap_sta_mode_ip_settings.gateway;

    // printf("configured ip address of the AP = %u \n", (uint8_t)ap_conf.ip_settings.ip_address.ip.v4);
    // nw_ipv4.ip.v4 = ap_conf.ip_settings.ip_address.ip.v4;
    // cy_nw_ntoa(&nw_ipv4, ip4_str);
    // printf("IPV4 address: %s\n", ip4_str);
    // cy_wcm_register_event_callback(&ap_event_callback);
    result = cy_wcm_start_ap(&ap_conf);
    if (result != CY_RSLT_SUCCESS) {
        printf("\ncy_wcm_start_ap failed...! \n");
        return;
    }
    // printf("\nAP started successfully... \n");

    // /* Get IPV4 address for AP */
    // result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_AP, &ipv4_addr);
    // if (result != CY_RSLT_SUCCESS)
    // {
    //     printf("\ncy_wcm_get_ip_addr failed...! \n");
    //     return;
    // }
    // printf("\nIPV4 address of AP : ");
    // nw_ipv4.ip.v4 = ipv4_addr.ip.v4;
    // cy_nw_ntoa(&nw_ipv4, ip4_str);
    // printf("IPV4 address: %s\n", ip4_str);

    // /* Get IPV6 address for AP */
    // printf("Link Local IPV6 AP address \n");
    // result = cy_wcm_get_ipv6_addr(CY_WCM_INTERFACE_TYPE_AP, CY_WCM_IPV6_LINK_LOCAL, &ipv6_addr);
    // if (result != CY_RSLT_SUCCESS)
    // {
    //     printf("\ncy_wcm_get_ipv6_addr failed...! \n");
    //     return;
    // }
    // printf("\nLink Local IPV6 AP address : ");
    // nw_ipv6.ip.v6[0] = ipv6_addr.ip.v6[0];
    // nw_ipv6.ip.v6[1] = ipv6_addr.ip.v6[1];
    // nw_ipv6.ip.v6[2] = ipv6_addr.ip.v6[2];
    // nw_ipv6.ip.v6[3] = ipv6_addr.ip.v6[3];
    // cy_nw_ntoa_ipv6(&nw_ipv6, ip6_str);
    // printf("IPV6 address: %s\n", ip6_str);

    // /* Get Link Local IPV6 STA address */
    // result = cy_wcm_get_ipv6_addr(CY_WCM_INTERFACE_TYPE_STA, CY_WCM_IPV6_LINK_LOCAL, &ipv6_addr);
    // if (result != CY_RSLT_SUCCESS)
    // {
    //     printf("\ncy_wcm_get_ipv6_addr failed...! \n");
    //     return;
    // }
    // printf("\nLink Local IPV6 STA address : ");
    // nw_ipv6.ip.v6[0] = ipv6_addr.ip.v6[0];
    // nw_ipv6.ip.v6[1] = ipv6_addr.ip.v6[1];
    // nw_ipv6.ip.v6[2] = ipv6_addr.ip.v6[2];
    // nw_ipv6.ip.v6[3] = ipv6_addr.ip.v6[3];
    // cy_nw_ntoa_ipv6(&nw_ipv6, ip6_str);
    // printf("IPV6 address: %s\n", ip6_str);

    // /* Get MAC address of both STA and AP interface using CY_WCM_INTERFACE_TYPE_AP_STA */
    // cy_wcm_mac_t *mac_addr_ptr;
    // mac_addr_ptr = (cy_wcm_mac_t*)malloc(sizeof(cy_wcm_mac_t) *2);
    // cy_wcm_get_mac_addr(CY_WCM_INTERFACE_TYPE_AP_STA, mac_addr_ptr);
    // cy_wcm_mac_t sta_mac, ap_mac;
    // memcpy(&sta_mac, mac_addr_ptr, sizeof(sta_mac));
    // printf("mac address of STA = %02X : %02X : %02X : %02X : %02X : %02X \n",
    //         sta_mac[0], sta_mac[1], sta_mac[2],sta_mac[3], sta_mac[4], sta_mac[5]);
    // mac_addr_ptr++;
    // memcpy(&ap_mac, mac_addr_ptr, sizeof(ap_mac));
    // printf("mac address AP = %02X : %02X : %02X : %02X : %02X : %02X \n",
    //         ap_mac[0], ap_mac[1], ap_mac[2],ap_mac[3], ap_mac[4], ap_mac[5]);
    // free(mac_addr_ptr);
}

// Print after constructor invoked
STATIC void network_ifx_wcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    // network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    //     TODO: Implement print with following parameters
    //       - link status (requires tcpip stack integration)
    //       - get and print ip address
    const char *status_str = "network status unknown. To be implemented in network.status().";

    /*if (status == CYW43_LINK_DOWN) {
        status_str = "down";
    } else if (status == CYW43_LINK_JOIN || status == CYW43_LINK_NOIP) {
        status_str = "join";
    } else if (status == CYW43_LINK_UP) {
        status_str = "up";
    } else if (status == CYW43_LINK_NONET) {
        status_str = "nonet";
    } else if (status == CYW43_LINK_BADAUTH) {
        status_str = "badauth";
    } else {
        status_str = "fail";
    }*/

    mp_printf(print, "<IFX WCM %s %u.%u.%u.%u>",
        status_str,
        0, // netif->ip_addr.addr & 0xff,
        0, // netif->ip_addr.addr >> 8 & 0xff,
        0, // netif->ip_addr.addr >> 16 & 0xff,
        0 // netif->ip_addr.addr >> 24
        );
}

STATIC mp_obj_t network_ifx_wcm_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    if (n_args == 0 || mp_obj_get_int(args[0]) == MOD_NETWORK_STA_IF) {
        return MP_OBJ_FROM_PTR(&network_ifx_wcm_wl_sta);
    } else {
        return MP_OBJ_FROM_PTR(&network_ifx_wcm_wl_ap);
    }
    return mp_const_none;
}

STATIC mp_obj_t network_ifx_wcm_send_ethernet(mp_obj_t self_in, mp_obj_t buf_in) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    whd_buffer_t *whd_buff = (whd_buffer_t *)&buf;
    int ret = whd_network_send_ethernet_data(whd_ifs[self->itf], *whd_buff);
    wcm_assert_raise(ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(network_ifx_wcm_send_ethernet_obj, network_ifx_wcm_send_ethernet);

