micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
/*******************************************************************************/
// network API

STATIC mp_obj_t network_ifx_wcm_deinit(mp_obj_t self_in) {
    // network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint32_t ret = cy_wcm_deinit();
    wcm_assert_raise(ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_deinit_obj, network_ifx_wcm_deinit);

STATIC mp_obj_t network_ifx_wcm_active(size_t n_args, const mp_obj_t *args) {
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
        }
    } else if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_ap_up());
        } else {
            if (mp_obj_is_true(args[1])) {

                // ret = cy_wcm_start_ap(&(self->itf_obj.ap_obj.ap_config));
                // if (ret != CY_RSLT_SUCCESS) {
                //     // mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("start_ap failed with error %lx !"), ret);
                //     mp_printf(&mp_plat_print, "\nstart_ap error: %lx\n", ret);
                // }
                // mp_printf(&mp_plat_print, "\nstart_ap error: %lx\n", ret);
                // // wcm_assert_raise(ret);
                snippet_wcm_concurrent_mode();

            } else {
                ret = cy_wcm_stop_ap();
                wcm_assert_raise(ret);
            }
        }
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_active_obj, 1, 2, network_ifx_wcm_active);

STATIC mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_passive, ARG_ssid, ARG_essid, ARG_bssid, ARG_channels };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_passive, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_essid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channels, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

    const char *band_string[] =
    {
        [CY_WCM_WIFI_BAND_ANY] = "2.4 and 5 GHz",
        [CY_WCM_WIFI_BAND_2_4GHZ] = "2.4 GHz",
        [CY_WCM_WIFI_BAND_5GHZ] = "5 GHz"
    };
    cy_wcm_mac_t scan_for_mac_value = {SCAN_FOR_MAC_ADDRESS};
    cy_rslt_t result = CY_RSLT_SUCCESS;

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    switch (scan_filter_mode_select)
    {
        case SCAN_FILTER_NONE:
            APP_INFO(("Scanning without any filter\n"));
            break;

        case SCAN_FILTER_SSID:
            APP_INFO(("Scanning for %s.\n", SCAN_FOR_SSID_VALUE));

            /* Configure the scan filter for SSID specified by
             * SCAN_FOR_SSID_VALUE.
             */
            scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_SSID;
            memcpy(scan_filter.param.SSID, SCAN_FOR_SSID_VALUE, sizeof(SCAN_FOR_SSID_VALUE));
            break;

        case SCAN_FILTER_RSSI:
            APP_INFO(("Scanning for RSSI > %d dBm.\n", SCAN_FOR_RSSI_VALUE));

            /* Configure the scan filter for RSSI range specified by
             * SCAN_FOR_RSSI_VALUE.
             */
            scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_RSSI;
            scan_filter.param.rssi_range = SCAN_FOR_RSSI_VALUE;
            break;

        case SCAN_FILTER_MAC:
            APP_INFO(("Scanning for %02X:%02X:%02X:%02X:%02X:%02X.\n", scan_for_mac_value[0], scan_for_mac_value[1], scan_for_mac_value[2], scan_for_mac_value[3], scan_for_mac_value[4], scan_for_mac_value[5]));

            /* Configure the scan filter for MAC specified by scan_for_mac_value
             */
            scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_MAC;
            memcpy(scan_filter.param.BSSID, &scan_for_mac_value, sizeof(scan_for_mac_value));
            break;

        case SCAN_FILTER_BAND:
            APP_INFO(("Scanning in %s band.\n", band_string[SCAN_FOR_BAND_VALUE]));

            /* Configure the scan filter for band specified by
             * SCAN_FOR_BAND_VALUE.
             */
            scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_BAND;
            scan_filter.param.band = SCAN_FOR_BAND_VALUE;
            break;

        default:
            break;
    }
    PRINT_SCAN_TEMPLATE();
    mp_obj_t res = mp_obj_new_list(0, NULL);
    ntwk_scan_result = MP_OBJ_TO_PTR(res);

    if (SCAN_FILTER_NONE == scan_filter_mode_select) {
        result = cy_wcm_start_scan(network_ifx_wcm_scan_cb, NULL, NULL);
    } else {
        result = cy_wcm_start_scan(network_ifx_wcm_scan_cb, NULL, &scan_filter);
    }

    /* Wait for scan completion if scan was started successfully. The API
     * cy_wcm_start_scan doesn't wait for scan completion. If it is called
     * again when the scan hasn't completed, the API returns
     * CY_WCM_RESULT_SCAN_IN_PROGRESS.

     * Wait for 10s timeout
     */
    if (CY_RSLT_SUCCESS == result) {
        cyhal_system_delay_ms(10000);
    }

    /* Define PRINT_HEAP_USAGE using DEFINES variable in the Makefile. */
    // print_heap_usage("After scan results are printed to UART");
    return res;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_scan_obj, 1, network_ifx_wcm_scan);

/* WHD based implementation - Future use
STATIC mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_passive, ARG_ssid, ARG_essid, ARG_bssid, ARG_channels };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_passive, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_essid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channels, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

